app/Controllers/Announcement.php

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new AnnouncementModel();

        // Fetch all announcements (we’ll add the table in Task 2)
        $data['announcements'] = $model->orderBy('created_at', 'DESC')->findAll();