app/Controllers/Auth.php

            $materialModel = new MaterialModel();

            // Courses handled by this teacher
            $teacherCourses = $courseModel->where('teacher_id', $user_id)->findAll();
---
SELECT *
FROM `courses`
WHERE `teacher_id` = '4'