app/Controllers/Auth.php

    public function login()
    {
        helper(['form', 'url']);
        $data = [];

        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[3]',
            ];

            if (!$this->validate($rules)) {
                $data['validation'] = $this->validator;
            } else {
                $db      = \Config\Database::connect();
                $builder = $db->table('users');
                $user    = $builder->where('email', $this->request->getPost('email'))->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'julalfpacis12@gmail.com'

    public function dashboard()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $role = $session->get('role');
        $name = $session->get('name');
        $user_id = $session->get('id');

        // 🧩 ADMIN DASHBOARD
        if ($role === 'admin') {
            $courseModel = new CourseModel();
            $courses = $courseModel->findAll();

            return view('admin/dashboard', [
                'name' => $name,
                'role' => $role,
                'courses' => $courses
            ]);
        }

        // 🧩 TEACHER DASHBOARD
        if ($role === 'teacher') {
            $courseModel = new CourseModel();
            $courses = $courseModel->findAll(); // You can filter teacher-owned courses later
---
SELECT *
FROM `courses`


            // Get available courses
            $availableCourses = count($enrolledIds) > 0
                ? $courseModel->whereNotIn('id', $enrolledIds)->findAll()
                : $courseModel->findAll();
---
SELECT *
FROM `courses`
WHERE `id` NOT IN ('21','22','23')
SELECT *
FROM `courses`