app/Controllers/Course.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $courseModel = new CourseModel();
        $courses     = $courseModel->findAll();

SELECT *
FROM `courses`
WHERE   (
`title` LIKE '%we%' ESCAPE '!'
OR  `course_code` LIKE '%we%' ESCAPE '!'
 )
---
    public function search()
    {
        // Accept search_term from GET or POST
        $searchTerm = trim((string) $this->request->getVar('search_term'));

        $courseModel = new CourseModel();

        // Apply LIKE filters only when there is a term
        if ($searchTerm !== '') {
            $courseModel
                ->groupStart()
                    ->like('title', $searchTerm)
                    ->orLike('course_code', $searchTerm)
                ->groupEnd();
        }

        $courses = $courseModel->findAll();