app/Controllers/Course.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrolled_at`) VALUES ('2', '2', '2025-10-15 02:24:45')
---
    public function enroll()
    {
        $session = session();
        $user_id = $session->get('id');
        $course_id = $this->request->getPost('course_id');

        $enrollModel       = new EnrollmentModel();
        $courseModel       = new CourseModel();
        $notificationModel = new NotificationModel();

        // Prevent duplicate enrollment
        if ($enrollModel->isAlreadyEnrolled($user_id, $course_id)) {
            return redirect()->back()->with('error', 'Already enrolled in this course.');
        }

        $enrollModel->insert([
            'user_id' => $user_id,
            'course_id' => $course_id,
            'enrolled_at' => date('Y-m-d H:i:s')
        ]);