app/Controllers/ManageUsers.php

    public function index()
    {
        $userModel = new UserModel();
        $users = $userModel->findAll();
---
SELECT *
FROM `users`