app/Models/EnrollmentModel.php

SELECT `enrollments`.*, `courses`.`title` as `course_title`, `courses`.`units` as `course_units`, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '4'
AND   (
`enrollments`.`status` = 'pending'
OR `enrollments`.`status` IS NULL
OR `enrollments`.`status` = ''
 )
ORDER BY `enrollments`.`enrolled_at` DESC
---
    public function getPendingForTeacher($teacherId)
    {
        try {
            return $this->select('enrollments.*, courses.title as course_title, courses.units as course_units, users.name as student_name, users.email as student_email')
                        ->join('courses', 'courses.id = enrollments.course_id')
                        ->join('users', 'users.id = enrollments.user_id')
                        ->where('courses.teacher_id', $teacherId)
                        ->groupStart()
                            ->where('enrollments.status', 'pending')
                            ->orWhere('enrollments.status', null)
                            ->orWhere('enrollments.status', '')
                        ->groupEnd()
                        ->orderBy('enrollments.enrolled_at', 'DESC')
                        ->findAll();

SELECT `enrollments`.*, `courses`.`title` as `course_title`, `courses`.`units` as `course_units`, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '4'
AND `enrollments`.`status` = 'active'
AND   (
`enrollments`.`end_date` IS NULL
OR DATE(enrollments.end_date) >= '2025-12-11'
 )
ORDER BY `courses`.`title` ASC, `users`.`name` ASC
---
    public function getActiveForTeacher($teacherId)
    {
        try {
            $today = date('Y-m-d');

            return $this->select('enrollments.*, courses.title as course_title, courses.units as course_units, users.name as student_name, users.email as student_email')
                        ->join('courses', 'courses.id = enrollments.course_id')
                        ->join('users', 'users.id = enrollments.user_id')
                        ->where('courses.teacher_id', $teacherId)
                        ->where('enrollments.status', 'active')
                        // Only show enrollments that are still within their end_date (or have no end_date)
                        ->groupStart()
                            ->where('enrollments.end_date IS NULL')
                            ->orWhere('DATE(enrollments.end_date) >=', $today)
                        ->groupEnd()
                        ->orderBy('courses.title', 'ASC')
                        ->orderBy('users.name', 'ASC')
                        ->findAll();