app/Models/MaterialModel.php

    public function getMaterialsByCourse(int $courseId): array
    {
        return $this->where('course_id', $courseId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = 21
ORDER BY `created_at` DESC