app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 2
AND `is_read` = 0
---
    public function getUnreadCount(int $userId): int
    {
        return $this->builder()
            ->where('user_id', $userId)
            ->where('is_read', 0)
            ->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = 2
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser(int $userId, int $limit = 5): array
    {
        $builder = $this->builder();

        return $builder
            ->where('user_id', $userId)
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN (2)
---
    public function markAsRead(int $notificationId): bool
    {
        return (bool) $this->builder()
            ->where('id', $notificationId)
            ->update(['is_read' => 1]);